Revit 2024 API
BalusterPattern.ExcessLengthFillSpacing Property
 The value defines the spacing between each baluster instance inserted in the excess length.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public double ExcessLengthFillSpacing { get; set; }
Visual Basic
Public Property ExcessLengthFillSpacing As Double
	Get
	Set
Visual C++
public:
property double ExcessLengthFillSpacing {
	double get ();
	void set (double value);
}
Remarks
 The spacing is used only if a baluster family is set to excess length fill.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for excessLengthFillSpacing must be between 0 and 30000 feet.
See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace